//
//  main.c
//  0711_issue_k19061
//
//  Created by k19061kk on 2019/07/11.
//  Copyright © 2019 AIT. All rights reserved.
//

/*-----------------------------------------------+
 プログラミング及び演習 第13回
 課題1
 入力した実数rを半径として、その円の面積と円周の長さを求めよ
   -面積と円周の長さを1つの空白で区切って1行に出力する
   -面積・円周の長さともに関数を定義する
 +-----------------------------------------------*/

// インクルード=========================================================
#include <stdio.h>
#include <math.h>

// 関数プロトタイプ宣言===================================================
double calcArea(double r);              // 半径rの円の面積を求める
double calcCircumference(double r);     // 半径rの円周の長さを求める

// 関数群===============================================================
//main()関数--------------------------------------------------
int main(int argc, const char * argv[]) {
    double r;       // 円の半径
    
    /*---入力---*/
    printf("input r: ");
    scanf("%lf", &r);
    
    /*---出力---*/
    printf("%f %f\n", calcArea(r), calcCircumference(r));

    return 0;
}

//その他の関数--------------------------------------------------
//-------------------------------------------------
// 半径rの円の面積を求める
// 引数 double r: 円の半径
// 返り値 円の面積を実数型で返す
//-------------------------------------------------
double calcArea(double r){
    return(pow(r, 2.0) * M_PI);
}

//-------------------------------------------------
// 半径rの円周の長さを求める
// 引数 double r: 円の半径
// 返り値 円周の長さを実数型で返す
//-------------------------------------------------
double calcCircumference(double r){
    return(2.0 * r * M_PI);
}
