//
//  0425_issue1_K19061.c
//  prg2019
//
//  Created by k19061kk on 2019/04/25.
//

/*---------------------------------------+
 プログラミング及び演習I 第3回
 課題1
 以下の計算を行い、最終結果dを下の出力例のように
 表示せよ。
 a=6,b=4,c=2
 d = a - (b / c)
 (出力例)
 6 - (4 / 2) = 4
 +---------------------------------------*/

#include <stdio.h>

int main(int argc, const char *argv[])
{
    int a, b, c, d;
    
    a = 6;
    b = 4;
    c = 2;
    d = a - (b / c);
    
    printf("%d - (%d / %d) = %d\n", a, b, c, d);
    
    return(0);
}
