//
//  0523_issue1_K19061.c
//  prg2019
//
//  Created by k19061kk on 2019/05/23.
//

/*---------------------------------------+
 プログラミング及び演習I 第6回
 課題1
 人数を入力し、その人数分の身長を入力すると、
 平均身長を出力するプログラムを作成せよ。
 +---------------------------------------*/

#include <stdio.h>

int main(int argc, const char *argv[])
{
    int n;        // 人数
    int sum = 0;  // 身長の合計
    int i;        // カウンタ変数
    int height;   // 身長を入力する変数
    
    // 人数の入力--------------------------------------------
    do{
        printf("人数? ");
        scanf("%d", &n);
        
        if(n <= 0){          // 入力値が不適切
            printf("適切な値を入力してください\n");
        }
    }while(n <= 0);
    //------------------------------------------------------
    
    // 合計値の計算-------------------------------------------
    for(i = 1;i <= n;i++){
        do{
            printf("%d人目の身長は? ", i);
            scanf("%d", &height);
            
            if(height <= 0){ // 入力値が不適切
                printf("適切な身長を入力してください\n");
            }
        }while(height <= 0);
        
        sum += height;
    }
    //------------------------------------------------------
    
    printf("平均身長は %f です\n", (double)sum / (double)n);
    
    return(0);
}
