//
//  0613_issue1_k19061.c
//  prg2019
//
//  Created by k19061kk on 2019/06/07.
//

/*---------------------------------------+
 プログラミング及び演習I 第9回
 課題1
 キーボードから整数配列へ3つずつ2回入力し、for文
 を用いてお互いの差を3つ出力せよ
 +---------------------------------------*/

#include <stdio.h>

int main(int argc, const char *argv[])
{
    int a[3], b[3];  // 入力値を格納する整数配列
    int i;           // カウンタ変数
    
    //入力---------------------------------------------------
    for(i = 0;i < 3;i++){
        printf("a[%d]? ", i);
        scanf("%d", &a[i]);
    }
    
    for(i = 0;i < 3;i++){
        printf("b[%d]? ", i);
        scanf("%d", &b[i]);
    }
    //-------------------------------------------------------
    
    //計算式を出力---------------------------------------------
    for(i = 0;i < 3;i++){
        printf("a[%d]-b[%d]= %d\n", i, i, a[i] - b[i]);
    }
    //-------------------------------------------------------
    
    return(0);
}
